In [2]:
import pandas as pd

In [5]:
data_csv = pd.read_csv('../datasets/Iris_data_sample.csv')
data_csv

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,NaN,1.4,0.2,NaN
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,??,3.1,1.5,0.2,Iris-setosa
4,5,5,3.6,###,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [8]:
# index_col=0 to use the first column as the index
data_csv = pd.read_csv('../datasets/Iris_data_sample.csv', index_col=0)

In [9]:
# Junk Values can be converted to missing values by passing them as a list 
# to the parameter na_values
data_csv = pd.read_csv('../datasets/Iris_data_sample.csv', index_col=0, na_values=['??', '###'])

In [12]:
# Reading Excel Files
data_xlsx = pd.read_excel("../datasets/Iris_data_sample.xlsx", sheet_name="Iris_data", index_col=0, na_values=['??', '###'])
data_xlsx

     SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm         Species
1              5.1           3.5            1.4           0.2     Iris-setosa
2              4.9           NaN            1.4           0.2             NaN
3              4.7           3.2            1.3           0.2     Iris-setosa
4              NaN           3.1            1.5           0.2     Iris-setosa
5              5.0           3.6            NaN           0.2     Iris-setosa
..             ...           ...            ...           ...             ...
146            6.7           3.0            5.2           2.3  Iris-virginica
147            6.3           2.5            5.0           1.9  Iris-virginica
148            6.5           3.0            5.2           2.0  Iris-virginica
149            6.2           3.4            5.4           2.3  Iris-virginica
150            5.9           3.0            5.1           1.8  Iris-virginica

[150 rows x 5 columns]

In [14]:
# Reading Text Files
data_txt1 = pd.read_table("../datasets/Iris_data_sample.txt", index_col=0, na_values=['??', '###']) 
data_txt1 # There are 5 columns in the text file, but it is showing only 1 column

Empty DataFrame
Columns: []
Index: [1 1 5.1 3.5 1.4 0.2 "Iris-setosa", 2 2 4.9 3 1.4 0.2 "Iris-setosa", 3 3 4.7 3.2 1.3 0.2 "Iris-setosa", 4 4 4.6 3.1 1.5 0.2 "Iris-setosa", 5 5 5 3.6 1.4 0.2 "Iris-setosa", 6 6 5.4 3.9 1.7 0.4 "Iris-setosa", 7 7 4.6 3.4 1.4 0.3 "Iris-setosa", 8 8 5 3.4 1.5 0.2 "Iris-setosa", 9 9 4.4 2.9 1.4 0.2 "Iris-setosa", 10 10 4.9 3.1 1.5 0.1 "Iris-setosa", 11 11 5.4 3.7 1.5 0.2 "Iris-setosa", 12 12 4.8 3.4 1.6 0.2 "Iris-setosa", 13 13 4.8 3 1.4 0.1 "Iris-setosa", 14 14 4.3 3 1.1 0.1 "Iris-setosa", 15 15 5.8 4 1.2 0.2 "Iris-setosa", 16 16 5.7 4.4 1.5 0.4 "Iris-setosa", 17 17 5.4 3.9 1.3 0.4 "Iris-setosa", 18 18 5.1 3.5 1.4 0.3 "Iris-setosa", 19 19 5.7 3.8 1.7 0.3 "Iris-setosa", 20 20 5.1 3.8 1.5 0.3 "Iris-setosa", 21 21 5.4 3.4 1.7 0.2 "Iris-setosa", 22 22 5.1 3.7 1.5 0.4 "Iris-setosa", 23 23 4.6 3.6 1 0.2 "Iris-setosa", 24 24 5.1 3.3 1.7 0.5 "Iris-setosa", 25 25 4.8 3.4 1.9 0.2 "Iris-setosa", 26 26 5 3 1.6 0.2 "Iris-setosa", 27 27 5 3.4 1.6 0.4 "Iris-setosa", 28 28 5.2 3.5 1.5 0.2 "Iris-setosa", 29 29 5.2 3.4 1.4 0.2 "Iris-setosa", 30 30 4.7 3.2 1.6 0.2 "Iris-setosa", 31 31 4.8 3.1 1.6 0.2 "Iris-setosa", 32 32 5.4 3.4 1.5 0.4 "Iris-setosa", 33 33 5.2 4.1 1.5 0.1 "Iris-setosa", 34 34 5.5 4.2 1.4 0.2 "Iris-setosa", 35 35 4.9 3.1 1.5 0.1 "Iris-setosa", 36 36 5 3.2 1.2 0.2 "Iris-setosa", 37 37 5.5 3.5 1.3 0.2 "Iris-setosa", 38 38 4.9 3.1 1.5 0.1 "Iris-setosa", 39 39 4.4 3 1.3 0.2 "Iris-setosa", 40 40 5.1 3.4 1.5 0.2 "Iris-setosa", 41 41 5 3.5 1.3 0.3 "Iris-setosa", 42 42 4.5 2.3 1.3 0.3 "Iris-setosa", 43 43 4.4 3.2 1.3 0.2 "Iris-setosa", 44 44 5 3.5 1.6 0.6 "Iris-setosa", 45 45 5.1 3.8 1.9 0.4 "Iris-setosa", 46 46 4.8 3 1.4 0.3 "Iris-setosa", 47 47 5.1 3.8 1.6 0.2 "Iris-setosa", 48 48 4.6 3.2 1.4 0.2 "Iris-setosa", 49 49 5.3 3.7 1.5 0.2 "Iris-setosa", 50 50 5 3.3 1.4 0.2 "Iris-setosa", 51 51 7 3.2 4.7 1.4 "Iris-versicolor", 52 52 6.4 3.2 4.5 1.5 "Iris-versicolor", 53 53 6.9 3.1 4.9 1.5 "Iris-versicolor", 54 54 5.5 2.3 4 1.3 "Iris-versicolor", 55 55 6.5 2.8 4.6 1.5 "Iris-versicolor", 56 56 5.7 2.8 4.5 1.3 "Iris-versicolor", 57 57 6.3 3.3 4.7 1.6 "Iris-versicolor", 58 58 4.9 2.4 3.3 1 "Iris-versicolor", 59 59 6.6 2.9 4.6 1.3 "Iris-versicolor", 60 60 5.2 2.7 3.9 1.4 "Iris-versicolor", 61 61 5 2 3.5 1 "Iris-versicolor", 62 62 5.9 3 4.2 1.5 "Iris-versicolor", 63 63 6 2.2 4 1 "Iris-versicolor", 64 64 6.1 2.9 4.7 1.4 "Iris-versicolor", 65 65 5.6 2.9 3.6 1.3 "Iris-versicolor", 66 66 6.7 3.1 4.4 1.4 "Iris-versicolor", 67 67 5.6 3 4.5 1.5 "Iris-versicolor", 68 68 5.8 2.7 4.1 1 "Iris-versicolor", 69 69 6.2 2.2 4.5 1.5 "Iris-versicolor", 70 70 5.6 2.5 3.9 1.1 "Iris-versicolor", 71 71 5.9 3.2 4.8 1.8 "Iris-versicolor", 72 72 6.1 2.8 4 1.3 "Iris-versicolor", 73 73 6.3 2.5 4.9 1.5 "Iris-versicolor", 74 74 6.1 2.8 4.7 1.2 "Iris-versicolor", 75 75 6.4 2.9 4.3 1.3 "Iris-versicolor", 76 76 6.6 3 4.4 1.4 "Iris-versicolor", 77 77 6.8 2.8 4.8 1.4 "Iris-versicolor", 78 78 6.7 3 5 1.7 "Iris-versicolor", 79 79 6 2.9 4.5 1.5 "Iris-versicolor", 80 80 5.7 2.6 3.5 1 "Iris-versicolor", 81 81 5.5 2.4 3.8 1.1 "Iris-versicolor", 82 82 5.5 2.4 3.7 1 "Iris-versicolor", 83 83 5.8 2.7 3.9 1.2 "Iris-versicolor", 84 84 6 2.7 5.1 1.6 "Iris-versicolor", 85 85 5.4 3 4.5 1.5 "Iris-versicolor", 86 86 6 3.4 4.5 1.6 "Iris-versicolor", 87 87 6.7 3.1 4.7 1.5 "Iris-versicolor", 88 88 6.3 2.3 4.4 1.3 "Iris-versicolor", 89 89 5.6 3 4.1 1.3 "Iris-versicolor", 90 90 5.5 2.5 4 1.3 "Iris-versicolor", 91 91 5.5 2.6 4.4 1.2 "Iris-versicolor", 92 92 6.1 3 4.6 1.4 "Iris-versicolor", 93 93 5.8 2.6 4 1.2 "Iris-versicolor", 94 94 5 2.3 3.3 1 "Iris-versicolor", 95 95 5.6 2.7 4.2 1.3 "Iris-versicolor", 96 96 5.7 3 4.2 1.2 "Iris-versicolor", 97 97 5.7 2.9 4.2 1.3 "Iris-versicolor", 98 98 6.2 2.9 4.3 1.3 "Iris-versicolor", 99 99 5.1 2.5 3 1.1 "Iris-versicolor", 100 100 5.7 2.8 4.1 1.3 "Iris-versicolor", ...]

[150 rows x 0 columns]

In [19]:
# Add the proper separator or delimiter to read the text file correctly
data_txt2 = pd.read_table("../datasets/Iris_data_sample.txt", index_col=0, na_values=['??', '###'], delimiter=' ')
data_txt2

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
1,1,5.1,3.5,1.4,0.2,Iris-setosa
2,2,4.9,3.0,1.4,0.2,Iris-setosa
3,3,4.7,3.2,1.3,0.2,Iris-setosa
4,4,4.6,3.1,1.5,0.2,Iris-setosa
5,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
146,146,6.7,3.0,5.2,2.3,Iris-virginica
147,147,6.3,2.5,5.0,1.9,Iris-virginica
148,148,6.5,3.0,5.2,2.0,Iris-virginica
149,149,6.2,3.4,5.4,2.3,Iris-virginica
150,150,5.9,3.0,5.1,1.8,Iris-virginica

In [21]:
# Reading Toyoto Dataset
cars_data = pd.read_csv("../datasets/Toyota.csv", index_col=0, na_values=['??', '###'])
cars_data

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986.0,Diesel,90,1.0,0,2000,three,1165
1,13750,23.0,72937.0,Diesel,90,1.0,0,2000,3,1165
2,13950,24.0,41711.0,Diesel,90,NaN,0,2000,3,1165
3,14950,26.0,48000.0,Diesel,90,0.0,0,2000,3,1165
4,13750,30.0,38500.0,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544.0,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,NaN,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016.0,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,NaN,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1.0,Petrol,110,0.0,0,1600,5,1114

### Creating Copy of Origianl Data
- *Shallow Copy*: creates a new variable that shares the referece of the original object.
- *Deep Copy*: A copy of object is copied in other object with no reference to the original.

In [34]:
cars_data1 = cars_data.copy(deep=False) # Shallow Copy
cars_data3 = cars_data # Shallow Copy
cars_data2 = cars_data.copy(deep=True) # Deep Copy

### Attributes of Data

In [23]:
# To get the index or row labels of the DataFrame
cars_data.index

Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
       ...
       1426, 1427, 1428, 1429, 1430, 1431, 1432, 1433, 1434, 1435],
      dtype='int64', length=1436)

In [24]:
# Get the column labels of the DataFrame
cars_data.columns

Index(['Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor', 'Automatic', 'CC',
       'Doors', 'Weight'],
      dtype='object')

In [26]:
# get the size of the data frame
cars_data.size

14360

In [27]:
# Get the dimensions of the DataFrame
cars_data.shape

(1436, 10)

In [28]:
# Get the memory usage of each column in bytes
cars_data.memory_usage()

Index        11488
Price        11488
Age          11488
KM           11488
FuelType     11488
HP           11488
MetColor     11488
Automatic    11488
CC           11488
Doors        11488
Weight       11488
dtype: int64

In [29]:
# Number of axes/ array dimensions
cars_data.ndim

2

### Indexing and Selecting Data

In [30]:
# Return the first n rows
cars_data.head(6)

   Price   Age       KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986.0   Diesel  90       1.0          0  2000  three    1165
1  13750  23.0  72937.0   Diesel  90       1.0          0  2000      3    1165
2  13950  24.0  41711.0   Diesel  90       NaN          0  2000      3    1165
3  14950  26.0  48000.0   Diesel  90       0.0          0  2000      3    1165
4  13750  30.0  38500.0   Diesel  90       0.0          0  2000      3    1170
5  12950  32.0  61000.0   Diesel  90       0.0          0  2000      3    1170

In [31]:
# Return last n rows
cars_data.tail(6)

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
1430,8450,80.0,23000.0,Petrol,86,0.0,0,1300,3,1015
1431,7500,NaN,20544.0,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,NaN,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016.0,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,NaN,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1.0,Petrol,110,0.0,0,1600,5,1114

`dataframe.head()` and `dataframe.tail()` helps when you sort the data or any kind of arrangments.

To access a scalar values, the fastest way is to use the `at` and `iat` methods.

In [32]:
# at provides label based scalar lookups
cars_data.at[4, 'FuelType']

'Diesel'

`.loc[]` To access a group of rows and columns

In [33]:
# To access a group of rows and columns by label(s) or a boolean array
cars_data.loc[:, 'FuelType']

0       Diesel
1       Diesel
2       Diesel
3       Diesel
4       Diesel
         ...
1431    Petrol
1432    Petrol
1433    Petrol
1434       NaN
1435    Petrol
Name: FuelType, Length: 1436, dtype: object

In [22]:
cocoa_data = pd.read_csv('../datasets/flavors_of_cocoa.csv')
null_values = cocoa_data.isnull().sum() 
print(null_values)

Id                  0
Company             0
Bean Origin         0
Review Date         4
Cocoa Percent       0
Company Location    0
Rating              0
dtype: int64

In [29]:
cocoa_data.describe() #

                Id  Review Date  Cocoa Percent       Rating
count  1795.000000  1791.000000    1795.000000  1795.000000
mean    898.000000  2012.321608      71.698329     3.185933
std     518.316184     2.928835       6.323118     0.478062
min       1.000000  2006.000000      42.000000     1.000000
25%     449.500000  2010.000000      70.000000     2.875000
50%     898.000000  2013.000000      70.000000     3.250000
75%    1346.500000  2015.000000      75.000000     3.500000
max    1795.000000  2017.000000     100.000000     5.000000

## Pandas DataFrame II

### Datatype
- Numeric and Character
- Numeric is either int64 or float64
- Why Datatype is important, Allocating spaces ahead of time allows computer to optimize storage and processing effeciency.

#### Difference Between Category and Object
- Category: A String values consisiting of only a few different values. Converting them will save memory from String to Category
- Object: When the columns has mixed types(number and strings). Nan will be by default object datatype.

In [36]:
cars_data.dtypes # Get the data types of each column

Price          int64
Age          float64
KM           float64
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

In [39]:
cars_data.dtypes.value_counts()

int64      4
float64    3
object     3
Name: count, dtype: int64

In [40]:
# Selecting data base don data types
cars_data.select_dtypes(include='float64')

       Age       KM  MetColor
0     23.0  46986.0       1.0
1     23.0  72937.0       1.0
2     24.0  41711.0       NaN
3     26.0  48000.0       0.0
4     30.0  38500.0       0.0
...    ...      ...       ...
1431   NaN  20544.0       1.0
1432  72.0      NaN       0.0
1433   NaN  17016.0       0.0
1434  70.0      NaN       1.0
1435  76.0      1.0       0.0

[1436 rows x 3 columns]

In [41]:
cars_data.select_dtypes(exclude=['float64', 'object'])

      Price  Automatic    CC  Weight
0     13500          0  2000    1165
1     13750          0  2000    1165
2     13950          0  2000    1165
3     14950          0  2000    1165
4     13750          0  2000    1170
...     ...        ...   ...     ...
1431   7500          0  1300    1025
1432  10845          0  1300    1015
1433   8500          0  1300    1015
1434   7250          0  1300    1015
1435   6950          0  1600    1114

[1436 rows x 4 columns]

In [44]:
cars_data.info() # Get a concise summary of the DataFrame

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(4), object(3)
memory usage: 155.7+ KB

In [43]:
import numpy as np

np.unique(cars_data['KM'])

array([1.0000e+00, 1.5000e+01, 2.2500e+02, ..., 2.3294e+05, 2.4300e+05,
              nan])

In [45]:
np.unique(cars_data['HP'])

array(['107', '110', '116', '192', '69', '71', '72', '73', '86', '90',
       '97', '98', '????'], dtype=object)

As HP contains '????', that's why it's data type is Object instead of integer.

In [46]:
np.unique(cars_data['MetColor'])

array([ 0.,  1., nan])

In [47]:
np.unique(cars_data['Automatic'])

array([0, 1])

In [48]:
np.unique(cars_data['Doors'])

array(['2', '3', '4', '5', 'five', 'four', 'three'], dtype=object)

Door's has been read as object instead of int64 because of valus 'five', 'four', 'three' which are strings.

### Converting Variable's data types

In [49]:
cars_data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(4), object(3)
memory usage: 155.7+ KB

In [51]:
# Convert the data type of MetColor to object
# Since MetColor is a categorical variable, we need to convert it to object
cars_data2['MetColor'] = cars_data2['MetColor'].astype('object') 

# Convert the data type of Automatic to object
# Since Automatic is a categorical variable, we need to convert it to object
cars_data2['Automatic'] = cars_data2['Automatic'].astype('object')

In [52]:
cars_data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   object
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(3), object(5)
memory usage: 155.7+ KB

### Category vs object data type

In [53]:
cars_data2['FuelType'].nbytes

11488

In [54]:
cars_data2['FuelType'].astype('category').nbytes

1460

In [56]:
# Remove '????' from the 'HP' column
cars_data2['HP'] = cars_data2['HP'].replace('????', np.nan)

In [61]:
cars_data2['HP'] = pd.to_numeric(cars_data2['HP'], errors='coerce') # Coerce invalid parsing will be set as NaN
np.unique(cars_data2['HP'])

array([ 69.,  71.,  72.,  73.,  86.,  90.,  97.,  98., 107., 110., 116.,
       192.,  nan])

In [62]:
cars_data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   object
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(3), object(4)
memory usage: 155.7+ KB

#### Cleaning column Doors

In [63]:
np.unique(cars_data2['Doors'])

array(['2', '3', '4', '5', 'five', 'four', 'three'], dtype=object)

In [66]:
cars_data2['Doors'].replace('three', '3', inplace=True)
cars_data2['Doors'].replace('four', '4', inplace=True)
cars_data2['Doors'].replace('five', '5', inplace=True)

# use replace using np.where() to replace values
# cars_data2['Doors'] = np.where(cars_data2['Doors'] == 'three', '3', cars_data2['Doors'])

In [67]:
cars_data2['Doors'] = cars_data2['Doors'].astype('int64')

In [68]:
cars_data2.isnull().sum() # To detect missing values

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64